In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
# importing data
cls_df = pd.read_csv('course_lead_scoring.csv')

cls_df.head()

,lead_source,industry,number_of_courses_viewed,annual_income,employment_status,location,interaction_count,lead_score,converted
0,paid_ads,NaN,1,79450.0,unemployed,south_america,4,0.94,1
1,social_media,retail,1,46992.0,employed,south_america,1,0.80,0
2,events,healthcare,5,78796.0,unemployed,australia,3,0.69,1
3,paid_ads,retail,2,83843.0,NaN,australia,1,0.87,0
4,referral,education,3,85012.0,self_employed,europe,3,0.62,1

In [3]:
# EDA
# exploring the stats of features
cls_df.describe(include='all')

,lead_source,industry,number_of_courses_viewed,annual_income,employment_status,location,interaction_count,lead_score,converted
count,1334,1328,1462.000000,1281.000000,1362,1399,1462.000000,1462.000000,1462.000000
unique,5,7,NaN,NaN,4,7,NaN,NaN,NaN
top,organic_search,retail,NaN,NaN,self_employed,north_america,NaN,NaN,NaN
freq,282,203,NaN,NaN,352,225,NaN,NaN,NaN
mean,NaN,NaN,2.031464,59886.273224,NaN,NaN,2.976744,0.506108,0.619015
std,NaN,NaN,1.449717,15070.140389,NaN,NaN,1.681564,0.288465,0.485795
min,NaN,NaN,0.000000,13929.000000,NaN,NaN,0.000000,0.000000,0.000000
25%,NaN,NaN,1.000000,49698.000000,NaN,NaN,2.000000,0.262500,0.000000
50%,NaN,NaN,2.000000,60148.000000,NaN,NaN,3.000000,0.510000,1.000000
75%,NaN,NaN,3.000000,69639.000000,NaN,NaN,4.000000,0.750000,1.000000
max,NaN,NaN,9.000000,109899.000000,NaN,NaN,11.000000,1.000000,1.000000

In [4]:
# find missing values
cls_df.isnull().sum()

lead_source                 128
industry                    134
number_of_courses_viewed      0
annual_income               181
employment_status           100
location                     63
interaction_count             0
lead_score                    0
converted                     0
dtype: int64

In [5]:
# datatypes of each feature variable
cls_df.dtypes

lead_source                  object
industry                     object
number_of_courses_viewed      int64
annual_income               float64
employment_status            object
location                     object
interaction_count             int64
lead_score                  float64
converted                     int64
dtype: object

In [6]:
# filtering categorical and numerical cols
cat_cols = cls_df.select_dtypes(include=['object', 'category']).columns
num_cols = cls_df.select_dtypes(include=['number']).columns

print(cat_cols, num_cols, sep='\n')

Index(['lead_source', 'industry', 'employment_status', 'location'], dtype='object')
Index(['number_of_courses_viewed', 'annual_income', 'interaction_count',
       'lead_score', 'converted'],
      dtype='object')

In [7]:
# replacing missing values
for col in cls_df.columns[cls_df.isnull().any()]:
    
    # replace NaN in cat cols with NA 
    if col in cat_cols:
        cls_df[col].fillna('NA', inplace=True)
        
    # replace NaN in cat cols with 0.0
    elif col in num_cols:
        cls_df[col].fillna(0.0, inplace=True)

print(cls_df.isnull().sum())
print()
print(cls_df.dtypes)

lead_source                 0
industry                    0
number_of_courses_viewed    0
annual_income               0
employment_status           0
location                    0
interaction_count           0
lead_score                  0
converted                   0
dtype: int64

lead_source                  object
industry                     object
number_of_courses_viewed      int64
annual_income               float64
employment_status            object
location                     object
interaction_count             int64
lead_score                  float64
converted                     int64
dtype: object

In [8]:
# looking at the stats of all features
cls_df.describe(include='all')

,lead_source,industry,number_of_courses_viewed,annual_income,employment_status,location,interaction_count,lead_score,converted
count,1462,1462,1462.000000,1462.000000,1462,1462,1462.000000,1462.000000,1462.000000
unique,6,8,NaN,NaN,5,8,NaN,NaN,NaN
top,organic_search,retail,NaN,NaN,self_employed,north_america,NaN,NaN,NaN
freq,282,203,NaN,NaN,352,225,NaN,NaN,NaN
mean,NaN,NaN,2.031464,52472.172367,NaN,NaN,2.976744,0.506108,0.619015
std,NaN,NaN,1.449717,24254.347030,NaN,NaN,1.681564,0.288465,0.485795
min,NaN,NaN,0.000000,0.000000,NaN,NaN,0.000000,0.000000,0.000000
25%,NaN,NaN,1.000000,44097.250000,NaN,NaN,2.000000,0.262500,0.000000
50%,NaN,NaN,2.000000,57449.500000,NaN,NaN,3.000000,0.510000,1.000000
75%,NaN,NaN,3.000000,68241.000000,NaN,NaN,4.000000,0.750000,1.000000
max,NaN,NaN,9.000000,109899.000000,NaN,NaN,11.000000,1.000000,1.000000